{
  "add_zero_attn": false,
  "architectures": [
    "UniBioseqForCausalLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bias": true,
  "eos_token_id": 2,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1280,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "is_prefix_decoder": true,
  "is_decoder": true,
  "is_clm":true,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "mask_token_id": 40,
  "max_position_embeddings": 3079,
  "model_type": "UniBioseqLM",
  "need_weights": false,
  "num_attention_heads": 20,
  "num_hidden_layers": 33,
  "pad_token_id": 1,
  "pooling_type": "MEAN",
  "prompt_token_id": 36,
  "token_dropout": false,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "use_cache": false,
  "vocab_list": [
    "<cls>",
    "<pad>",
    "<eos>",
    "<unk>",
    "L",
    "A",
    "G",
    "V",
    "S",
    "E",
    "R",
    "T",
    "I",
    "D",
    "P",
    "K",
    "Q",
    "N",
    "F",
    "Y",
    "M",
    "H",
    "W",
    "C",
    "X",
    "B",
    "U",
    "Z",
    "O",
    ".",
    "-",
    "a",
    "u",
    "c",
    "g",
    "n",
    "+",
    "<null_1>",
    "<null_2>",
    "<null_3>",
    "<mask>"
  ],
  "vocab_size": 41
}
